In [34]:
import pandas as pd
import numpy as np

## sum total number of tourist per nationality per year
given info - number of tourist per nationaity per month

#### sum the total number of tourists of year

In [35]:
BCN_2018 = pd.read_csv(".\clean_datasets\BCN_2018_CLEAN.csv")
BCN_2018.head()

   Unnamed: 0               Country   Number    Month
0           0            Alemanya    24885.0  January
1           1             Àustria     2705.0  January
2           2             Bèlgica     8075.0  January
3           3            Bulgària      575.0  January
4           4               Xipre      244.0  January

In [36]:
from sqlalchemy import create_engine
import pymysql

In [37]:
driver = "mysql+pymysql"
user = "root"
password = "Ir0nhack"
ip = "35.192.169.188"
database = "Project_2"

In [38]:
connection_string = f"{driver}://{user}:{password}@{ip}/{database}"

In [39]:
engine = create_engine(connection_string)

In [42]:
query = """ SELECT Country, SUM(Number) AS TOTAL
FROM BCN_2018
GROUP BY Country
ORDER BY TOTAL DESC
LIMIT 5
"""

In [41]:
pd.read_sql(query, engine)

                        Country     TOTAL
0                Estats Units    846595.0
1                  Regne Unit    678619.0
2                      França    655510.0
3                      Itàlia    509106.0
4                    Alemanya    425383.0
5                Resta d'Àsia    306296.0
6               Resta del món    297774.0
7            Resta d'Amèrica     238072.0

In [43]:
query = """ SELECT Country, SUM(Number) AS TOTAL
FROM BCN_2018
GROUP BY Country
ORDER BY TOTAL 
LIMIT 5
"""

In [44]:
pd.read_sql(query, engine)

                     Country   TOTAL
0            Liechtenstein    1418.0
1                    Xipre    4336.0
2                  Estònia    4482.0
3                Eslovènia    5094.0
4                    Malta    5197.0